InformationRegisters/ПравилаОбработкиФайлаПрограммыПостроителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПравилаОбработкиФайлаПрограммыПостроителя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщееКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬ_ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругленияЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВариантОпределенияКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУникальности</Name>
					<Comment>Для определения по какому правилу добавлена номенклатура на случай если одна номенклатура добавляется по нескольким правилам</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПараметрФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыФайлаПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТабличнаяЧастьЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрФайлаДляОбработкиЗначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыФайлаПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеПараметраДляОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПравилоБезПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПравила</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравилОбработкиФайлаПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСоздаваемойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСравненияПараметраДляОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСравнений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Монтаж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПравилОбработкиФайлаПрограммыПостроителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПравилОбработкиФайлаПрограммыПостроителя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавлениеНоменклатурыВДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаНоменклатурыПродукции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПравилаОбработкиФайлаПрограммыПостроителя/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОбщееКоличество.Видимость = (Запись.ВариантОпределенияКоличества = 2);
	ЗаполнитьСписокВыбораТЧ();
	
	УправлениеФормой();
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.ПорядокОкругления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Запись.ВариантОпределенияКоличества = 0 Тогда
		Запись.ВариантОпределенияКоличества = 1;
		Модифицированность = Истина;
		ВариантОпределенияКоличестваПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПравилаПриИзменении(Элемент)
	УправлениеФормой();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТЧ()
	
	ДанныеСпискаВыбора = Новый СписокЗначений;
			
	Если Запись.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказПокупателя Тогда
		ДанныеСпискаВыбора.Добавить("Товары");
		ДанныеСпискаВыбора.Добавить("Материалы");
		
	ИначеЕсли Запись.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказНаПроизводство Тогда
		ДанныеСпискаВыбора.Добавить("Материалы"); //#14862
		
	ИначеЕсли Запись.ВидЗаказа = Перечисления.ВидыЗаказов.ЗаказДоговор Тогда
		ДанныеСпискаВыбора.Добавить("ТоварыУслуги", "Товары и услуги");
		//ДанныеСпискаВыбора.Добавить("Услуги"); // №5793, услуги в ТЧ ТоварыУслуги
		ДанныеСпискаВыбора.Добавить("Материалы");
		
	ИначеЕсли Запись.ВидЗаказа = Перечисления.ВидыЗаказов.Монтаж Тогда // №5793, добавлен монтаж
		ДанныеСпискаВыбора.Добавить("Материалы");
	КонецЕсли;
	
	Элементы.ТабличнаяЧастьЗаказа.СписокВыбора.ЗагрузитьЗначения(ДанныеСпискаВыбора.ВыгрузитьЗначения());

КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораТЧ();
	Запись.ТабличнаяЧастьЗаказа = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ВариантОпределенияКоличестваПриИзмененииНаСервере()
	Элементы.ОбщееКоличество.Видимость = (Запись.ВариантОпределенияКоличества = 2);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОпределенияКоличестваПриИзменении(Элемент)
	
	//ВариантОпределенияКоличестваПриИзмененииНаСервере();
	Если НЕ Запись.ВариантОпределенияКоличества = 1 Тогда
		Запись.Коэффициент = 1; //#13814 
	КонецЕсли;
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.ЕдиницаИзмерения = Запись.Номенклатура.БазоваяЕдиницаИзмерения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПравилоБезПараметраПриИзменении(Элемент)
	
	УправлениеФормой(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой(СброситьЗначения = Ложь)
	
	Элементы.ПараметрФайла.Доступность = НЕ Запись.ЭтоПравилоБезПараметра;
	Элементы.ВариантОпределенияКоличества.Доступность = НЕ Запись.ЭтоПравилоБезПараметра;
	Если СброситьЗначения И Запись.ЭтоПравилоБезПараметра Тогда
		Запись.ПараметрФайла = Справочники.ПараметрыФайлаПрограммыПостроителя.ПустаяСсылка();
		Запись.ВариантОпределенияКоличества = 2;
		Запись.Коэффициент = 1; //#13814
	КонецЕсли;
	Элементы.ОбщееКоличество.Видимость = (Запись.ВариантОпределенияКоличества = 2);

	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(Запись.ВидПравила = ПредопределенноеЗначение("Перечисление.ВидыПравилОбработкиФайлаПрограммыПостроителя.ОбработкаНоменклатурыПродукции"),
												Элементы.СтраницаОбработка,
												Элементы.СтраницаДобавление);
												
	ЭтоПродукция = (Запись.ВидСоздаваемойНоменклатуры = Справочники.ВидыНоменклатуры.Продукция);
	
	Элементы.ГруппаДополнительныеУсловия.Видимость = (НЕ ЭтоПродукция);
	Элементы.ГруппаПараметрПравила.Видимость = (НЕ ЭтоПродукция);	
	Элементы.ВидПродукции.Видимость = ЭтоПродукция;
	
	Элементы.Коэффициент.Видимость = (Запись.ВариантОпределенияКоличества = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказПокупателя"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказНаПроизводство")); //#14862	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ЗаказДоговор"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЗаказов.Монтаж")); // №5793
	
КонецПроцедуры

//++ №13814
&НаКлиенте
Процедура ВидСоздаваемойНоменклатурыПриИзменении(Элемент)
	
	ЭтоПродукция = (Запись.ВидСоздаваемойНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"));
	
	Запись.ЭтоПравилоБезПараметра = ЭтоПродукция;
	Если НЕ ЭтоПродукция Тогда
		Запись.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");	
	КонецЕсли;
	
	УправлениеФормой(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(Запись.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры
//-- №13814
